package com.kotenkov.algoritmization.decomposition.task_2;

//  Написать метод(методы) для нахождения наибольшего общего делителя четырех натуральных чисел.

public class MainTask2 {

    public static void main(String[] args) {

        int nod = Task2.findNOD(15, 30, 45, 60);
        System.out.println("Наибольший общий делитель: " + nod);

    }

}
