package com.kotenkov.algoritmization.decomposition.task_7;

//  Написать метод(методы) для вычисления суммы факториалов всех нечетных чисел от 1 до 9

public class MainTask7 {

    public static void main(String[] args) {

        System.out.println("\nСумма факториалов всех нечетных чисел от 1 до 9 равна " +
                            Task7.doTask7());

    }

}
