package com.kotenkov.basics_of_oop.task_5;

//  Создать консольное приложение, удовлетворяющее следующим требованиям:
//        • Корректно спроектируйте и реализуйте предметную область задачи.
//        • Для создания объектов из иерархии классов продумайте возможность использования порождающих шаблонов
//          проектирования.
//        • Реализуйте проверку данных, вводимых пользователем, но не на стороне клиента.
//        • для проверки корректности переданных данных можно применить регулярные выражения.
//        • Меню выбора действия пользователем можно не реализовывать, используйте заглушку.
//        • Особое условие: переопределите, где необходимо, методы toString(), equals() и hashCode().

//  Реализовать приложение, позволяющее создавать цветочные композиции (объект, представляющий собой
//  цветочную композицию). Составляющими цветочной композиции являются цветы и упаковка.

import com.kotenkov.basics_of_oop.task_5.menu.Menu;

public class MainTask5 {

    public static void main(String[] args) {
        Menu menu = new Menu();
        menu.showMainMenu();
    }

}
